Repository: kamperh/kamperh.github.io
Catalog: data/siyavula_en_af.3.tmx
Source language: en
Languages: af

source: on monday rajesh had carrots in the spaghetti bolognaise and on thursday he had salad and butternut with his meal .
af: maandag het rajesh wortels in die spaghetti bolognaise gehad en donderdag het hy slaai en botterskorsie as deel van sy ete gehad .

source: what important food group is rajesh missing from his diet if he does not eat enough fruit and vegetables ?
af: watter belangrike voedselgroep ontbreek in rajesh se dieet as hy nie genoeg vrugte en groente eet nie ?

source: he will not be getting enough vitamins and minerals .
af: hy sal nie genoeg vitamiene en minerale kry nie .

source: can you predict what will happen if rajesh continues with this diet ?
af: kan jy voorspel wat met rajesh sal gebeur as hy met hierdie dieet volhou ?

source: if he is not already very overweight he soon will be overweight and may develop problems that accompany this diabetes bad skin aching joints greater risk of heart disease etc .
af: as hy nie alreeds baie oorgewig is nie gaan hy binnekort oorgewig raak en die probleme ontwikkel wat daarmee saamgaan diabetes slegte vel seer gewrigte groter risiko vir hartsiektes ens .

source: now that you have tallied up the different food groups that rajesh ate in a week do you think he ate a balanced diet ?
af: noudat jy die verskillende voedselsoorte wat rajesh in 'n week eet opgetel het dink jy hy volg 'n gebalanseerde dieet ?

source: why do you say so ?
af: hoekom s jy so ?

source: rajesh's diet was not balanced because rajesh did not eat the correct quantities of food from the different food groups and therefore i don't think their diet is very balanced .
af: rajesh se dieet is ongebalanseerd omdat hy nie die regte hoeveelhede voedsel uit die verskillende voedselgroepe eet nie .

source: do you think rajesh is a very active person ?
af: dink jy rajesh is 'n baie aktiewe persoon ?

source: he lies in front of the tv most afternoons and his only extramural activity is band practice which is not very energetic .
af: hy l die meeste middae voor die tv en sy enigste buitemuurse aktiwiteit is orkesoefening wat nie baie aktief is nie .

source: indoor hockey once a week is probably not enough exercise .
af: binneshuise hokkie een keer per week verskaf nie genoeg oefening nie .

source: takeaways are known for being fatty and oily because restaurants often prepare the food in deep oil .
af: wegneemetes is bekend daarvoor dat dit baie vette en olies bevat aangesien restaurante dikwels hulle kos in diep olie voorberei .

source: rajesh's family ate takeaways twice in the week and the mom cooked twice .
af: rajesh se gesin kry twee keer per week wegneemetes en die ma kook twee keer .

source: compare the cooked meals with the takeaways specifically focusing on the amount of oil used to prepare the meals .
af: vergelyk die gekookte maaltye met die wegneemetes en fokus spesifiek op die hoeveelheid olie wat gebruik is om die kos in voor te berei .

source: the bolognese and the roast chicken were probably prepared at home and the pizza and 'bucket' chicken were probably takeaways .
af: die bolognaise en geroosterde hoender is vermoedelik by die huis voorberei en die pizza en emmer hoender is wegneemetes .

source: the roast chicken meal included a lot of vegetables and the bolognese included carrots in the mince as is the tradition in many homes .
af: die ete met die geroosterde hoender het baie groente ingesluit en die bolognaise het wortels in die maalvleis gehad soos wat die tradisie in baie huise is .

source: these meals are far healthier than the oily chicken or pizza that they had because they contain fewer oils and more vegetables .
af: hierdie etes is baie gesonder as die olierige hoender of pizza wat hulle gehad het omdat dit minder olie en meer groente bevat het .

source: learners should include something about eating a more balanced diet which would include eating more fresh fruit and vegetables and less fats sugars and oils .
af: leerders moet iets insluit oor 'n meer gebalanseerde dieet wat sal insluit meer vars vrugte en groente en minder vette suikers en olie .

source: rajesh should cut down on the amount of sugar he puts in his hot drinks he should always eat breakfast in the morning he should not rush when he eats his meals and just buy food from a tuck shop .
af: rajesh moet die hoeveelheid suiker in sy warm drankies verminder hy moet altyd ontbyt eet hy moenie haastig wees as hy eet nie en hy moenie kos by die snoepie koop nie .

source: rajesh should also become more active and not just lie in front of the tv for the afternoon .
af: rajesh moet ook meer aktief word en nie elke middag voor die tv l nie .

source: rajesh should also consider talking to their parents about the meals they are given in the evening .
af: rajesh moet dit oorweeg om met hulle ouers te praat oor die etes wat hulle in die aande kry .

source: they should not have takeaways so often and the parents should also take responsibility for what their children eat .
af: hulle moenie so gereeld wegneemetes eet nie en die ouers behoort verantwoordelikheid te neem vir wat hulle kinders eet .

source: now that you have completed this activity explain why different portions of the different food groups are necessary for a balanced diet ?
af: noudat jy hierdie aktiwiteit voltooi het verduidelik hoekom verskillende porsies van die verskillende voedselgroepe noodsaaklik vir 'n gebalanseerde dieet is .

source: option 1 fruit loops
af: opsie 1 versoete graankos

source: option 2 fruit salad
af: opsie 2 vrugteslaai

source: the fruit salad is healthier as it contains a variety of fresh fruit which will satisfy some of your daily requirement of fruit and vegetables .
af: die vrugteslaai is gesonder aangesien dit 'n verskeidenheid vars vrugte insluit wat 'n gedeelte van die dag se nodige vrugte en groente inname is .

source: the fruit loops are unhealthy as they contain a lot of sugars colourants and flavourants .
af: die versoete graankos is ongesond omdat dit baie suiker kleursel en geursel bevat .

source: they do not have any nutritional value .
af: dit het minder voedingswaarde .

source: option 1 oats with raspberries
af: opsie 1 hawermout met frambose

source: option 2 flapjacks with syrup
af: opsie 2 plaatkoekies met stroop

source: the oats with raspberries is more healthy compared to the flapjacks with syrup .
af: die hawermout met frambose is gesonder vergeleke met die plaatkoekies met stroop .

source: oats is a good source of nutrition and the raspberries are very high in vitamins .
af: hawermout is 'n goeie bron van voeding en frambose is ryk aan vitamiene .

source: the flapjacks are unhealthy for breakfast as they contain a lot of fats and sugar .
af: die plaatkoekies vir ontbyt is ongesond aangesien dit baie vette en suiker bevat .

source: option 1 egg salad
af: opsie 1 eierslaai

source: option 2 fried chips
af: opsie 2 diepgebraaide aartappelskyfies

source: the egg salad is the healthy option .
af: die eierslaai is die gesonder opsie .

source: this meal contains a variety of food groups as there are fruits and vegetables containing vitamins and minerals and the eggs are a good source of protein .
af: die maaltyd bevat 'n verskeidenheid voedselgroepe aangesien daar vrugte en groente by is wat vitamiene en minerale bevat en eiers wat 'n goeie bron van proteen is .

source: the fried chips are very unhealthy as a meal as this only consists of one food group starch and there is added oil from the frying .
af: die diepgebraaide skyfies is baie ongesond aangesien die ete hoofsaaklik uit een voedselgroep stysel bestaan en daar is olie bygevoeg met die diepbraai .

source: option 1 hamburger
af: opsie 1 hamburger

source: option 2 omelette with salad
af: opsie 2 omelette met slaai

source: the omelette is the healthy option .
af: die omelette is die gesonder opsie .

source: as with the egg salad this meal contains fresh salad and the eggs are a source of protein. the omelette possibly has meat or mushrooms and cheese which also adds to the nutritional content .
af: net soos met die eierslaai bevat hierdie maaltyd vars slaai en die eiers is 'n bron van proteen .

source: although the hamburger contains meat starch and cheese it was probably prepared in an unhealthy way .
af: die omelette het moontlik vleis of sampioene en kaas in wat ook voedingswaarde toevoeg .

source: consider that the meat was fried in oil and that the bread has less nutritional value than vegetable starches .
af: alhoewel die hamburger vleis stysel en kaas bevat is dit moontlik op 'n ongesonde manier voorberei .

source: this meal also lacks fresh fruit or vegetables .
af: dink daaraan dat die vleis in olie gaargemaak is en dat die brood minder voedingswaarde het as groentestysels .

source: option 1 chicken pieces
af: opsie 1 hoenderstukkies

source: option 2 beef peas and rice
af: opsie 2 beesvleis ertjies en rys

source: the beef peas and rice is the healthy option for supper as the meal contains starch rice meat for protein beef as well as vegetables peas .
af: die beesvleis ertjies en rys is die gesonder opsie vir aandete aangesien die ete stysel rys vleis as proteen beesvleis en groente ertjies bevat .

source: the other meal is unhealthy as it only contains one food group namely protein from the chicken pieces .
af: die ander ete is minder gesond omdat dit hoofsaaklik een voedselgroep bevat naamlik die proteen van die hoenderstukkies en heelwat vet in die vel en olie van die braaiproses .

source: there are many people in the world that do not or are not able to eat a healthy balanced diet .
af: daar is baie mense op aarde wat nie 'n gesonde gebalanseerde dieet volg of kan volg nie .

source: many choose to eat an unhealthy diet while others do not have a choice .
af: baie mense kies om ongesond te eet terwyl ander nie 'n keuse het nie .

source: many people live in cities and can afford to buy takeaways often or to eat hastily prepared meals that do not always include foods from the 4 food groups .
af: baie mense woon in stede en kan dit bekostig om gereeld wegneemetes te koop of om haastig voorbereide maaltye te eet wat nie al vier die voedselgroepe insluit nie .

source: remember the food pyramid we saw before ?
af: onthou jy die voedselpiramide waarna ons vroer gekyk het ?

source: below is a picture of the food pyramid of someone with an unhealthy diet .
af: langsaan is 'n skets van 'n voedselpiramide van iemand met 'n ongesonde dieet .

source: discuss in your class why you think this kind of food pyramid is unhealthy .
af: bespreek met jou maats waarom jy dink dat hierdie tipe voedselpiramide ongesond is .

source: compare it to the healthy food pyramid and write down some of the differences below .
af: vergelyk dit met die gesonde voedselpiramide en skryf sommige van die verskille hieronderneer .

source: this food pyramid is out of proportion compared to the previous one and does not form the shape of a pyramid anymore .
af: die voedselpiramide is uit verhouding in vergelyking met die vorige een en vorm nie meer 'n piramide nie .

source: this is because the person eats a lot more fats and oils compared to how much they should eat in a healthy diet .
af: dit is omdat die persoon baie meer soetgoed vette en olies eet as wat hy as deel van 'n gesonde dieet behoort in te neem .

source: the amounts of meat and dairy products are about the same .
af: die hoeveelhede vleis en suiwelprodukte is naastenby dieselfde .

source: but there is a lack of fruit and vegetables in the diet .
af: daar is egter 'n tekort aan vrugte en groente in die dieet .

source: this is very unhealthy as the person will not be getting enough vitamins and minerals in their diet .
af: dit is baie ongesond omdat die persoon nie genoeg vitamiene en minerale in sy dieet kry nie .

source: some families have to eat what they can afford .
af: ander gesinne moet eet wat hulle kan bekostig .

source: they do not have the privilege of choosing what their food pyramid looks like but eat what they can buy with their small incomes .
af: hulle het nie die voorreg om te kies hoe hulle voedselpiramide lyk nie maar eet net wat hulle met hul klein inkomste kan bekostig .

source: this would mostly consist of carbohydrates and some vegetables and rarely includes meat and enough proteins and other vitamins .
af: dit bestaan meestal uit koolhidrate en sommige groentes en sluit selde vleis en genoeg proteene en ander vitamiene in .

source: let's look at the causes of a poor unhealthy diet and then at possible diseases that may arise from this .
af: kom ons kyk na die oorsake van 'n swak ongesonde dieet en dan na moontlike siektes wat hieruit kan voortspruit .

source: there are many causes of a poor diet .
af: daar is baie oorsake van 'n swak dieet .

source: in these situations people will eat whatever food is available to them often leading to an unhealthy diet .
af: in sulke gevalle sal mense enigiets eet wat beskikbaar is en dit lei tot 'n ongesonde dieet .

source: a balanced diet also means drinking water throughout the day !
af: 'n gebalanseerde dieet beteken ook dat jy deurlopend water moet drink !

source: an unhealthy diet can lead to many health problems because the body does not get the right amount of the different food groups and therefore cannot function properly .
af: 'n ongesonde dieet kan aanleiding gee tot baiegesondheidsprobleme aangesien die liggaam nie die regte hoeveelhede van die verskillende voedselsoorte inkry nie en die liggaam gevolglik nie behoorlik kan funksioneer nie .

source: it is not necessary for learners to know the difference between a disease and a condition but generally a disease refers to an illness or some deviation from the normal functioning of the body or organ .
af: dit is nie nodig dat die leerders die verskil tussen 'n siekte en 'n toestand ken nie maar gewoonlik verwys 'n siekte na een of ander afwyking van die normale funksionering van die liggaam of orgaan .

source: a condition however is a more broader term and often refers to the state of something .
af: 'n toestand is egter 'n wyer begrip wat die staat van gesondheid aandui .

source: often we get diseases and conditions because our bodies do not get the necessary nourishment .
af: dikwels kry ons siektes en toestande omdat ons liggame nie die nodige voeding inkry nie .

source: some of these diseases are
af: sommige van hierdie siektes is

source: e.tv news story on obesity in south africa http www.youtube.com watch?v drp0oy9li1o
af: e.tv nuusberig oor vetsug in suid afrika. goo.gl h6mgu

source: what is diabetes? video http www.youtube.com watch?v 4eetubb74lm
af: wat is diabetes? video goo.gl fxjou

source: obesity
af: vetsug

source: overeating and inactivity
af: ooreet en onaktiwiteit

source: rickets
af: ragitis

source: possibly because of the small amount of fruit and vegetables eaten
af: moontlik vanwe die klein hoeveelhede vrugte en groente wat hy eet

source: eating far too much sugar and starches inactivity
af: te veel suiker en stysel onaktiwiteit

source: constipation
af: hardlywigheid

source: rajesh is very inactive and almost never drinks any water !
af: rajesh is baie onaktief en drink omtrent nooit enige water nie !

source: this can be used as a possible project where learners can also present their posters to the class and practise their oral skills .
af: dit kan gebruik word as 'n moontlike projek waar leerders hulle plakkate aan die klas kan voorhou en so hul mondelinge vaardighede kan oefen .

source: be sensitive to the fact that some children in your class may suffer from some of these diet related diseases .
af: wees sensitief vir die feit dat sommige kinders in die klas aan party van hierdie dieet verwante siektes mag lei .

source: what do you understand by the term balanced diet ?
af: wat verstaan jy onder die begrip gebalanseerde dieet ?

source: write a description below .
af: beskryf dit hieronder .

source: draw a food pyramid of the food that you eat and assess whether it has the correct shape of a balanced diet .
af: teken 'n voedselpiramide van die kosse wat jy eet en beoordeel of dit die korrekte vorm van 'n gebalanseerde dieet het .

source: mark individual learner's food pyramids based on the one used earlier in the book .
af: merk individuele leerders se voedselpiramides volgens die een wat vroer in die boek gebruik is .

source: rajesh thinks that he can get enough water in his diet by drinking coke and coffee with sugar in it .
af: rajesh glo dat hy genoeg water inkry deur coke en koffie met suiker te drink .

source: explain to him if this is true or not and why .
af: verduidelik aan hom of dit waar is of nie en hoekom .

source: write a paragraph where you explain some of the possible causes of a poor diet .
af: skryf 'n paragraaf waarin jy die moontlike oorsake van 'n swak dieet beskryf .

source: this topic forms part of food science which is an exciting branch of science that incorporates chemistry biology and physics with real world applications .
af: hierdie onderwerp vorm deel van voedingswetenskappe wat 'n opwindende afdeling van wetenskap is .

source: remind students that this term's work has focused on how food is made through photosynthesis and the important role that plants play in this process .
af: herinner leerders dat hierdie termyn se werk fokus op hoe voedsel geproduseer word deur fotosintese en die belangrike rol wat plante in hierdie proses speel .

source: we then moved on to investigate nutrition and the importance of a balanced diet before looking at the diseases and health problems associated with a poor diet .
af: daarna het ons aanbeweeg na voeding en die belangrikheid van 'n gebalanseerde dieet voordat ons gekyk het na die siektes en gesondheidsprobleme wat met 'n swak dieet geassosieer word .

source: in this chapter we'll look at food processing and how humans have devised ways to keep food healthier for longer .
af: in hierdie hoofstuk kyk ons na voedselverwerking en hoe mense maniere gevind het om voedsel vir langer tye te bewaar .

source: this is an excellent website for lesson plans and support materials http www.jhsph.edu research centers and institutes teaching the food system curriculum food processing.html
af: hierdie webblad is uitstekend vir lesplanne en ondersteuningsmateriaal http www.jhsph.edu research centers and institutes teaching the food system curriculum food processing.html

source: people have been processing food for thousands of years .
af: mense verwerk voedsel al duisende jare lank .

source: before the invention of fridges and freezers people had to collect food in summer and store it because in winter food is often scarce .
af: voor die uitvinding van die yskas en vrieskas moes mense kos in die somer bymekaar maak en dit bewaar vir die winter wanneer kos baie keer skaars was .

source: they found out that they could preserve food like meat and fish by salting and spicing and then drying it this is called curing the meat .
af: hulle het uitgevind dat hulle kosse soos vleis en vis kon bewaar deur dit te sout in speserye te laat l en dan te droog ons s ons pekel die vleis .

source: in south africa biltong and bokkoms are examples of cured meat and fish .
af: in suid afrika is biltong en bokkoms voorbeelde van gepekelde vleis en vis .

source: drying foods video . http www.youtube.com watch?v fksgyjk e3c&amp;feature related
af: gedroogde voedsel video . http www.youtube.com watch?v fksgyjk e3c&amp;feature related

source: this is a chance for learners to be creative and use their imaginations .
af: dit bied leerders die geleentheid om kreatief te wees en hulle verbeeldings te gebruik .

source: encourage them to do so .
af: moedig hulle aan om dit te doen .

source: if time does not permit the learners do not have to actually make the objects to take with them .
af: as tyd dit nie toelaat nie hoef die leerders nie al die voorwerpe te maak om saam met hulle te neem nie .

source: but allow them time to discuss the possible objects they could make in their groups .
af: laat hulle egter tyd toe om die moontlike voorwerpe wat hulle kon maak in hulle groepe te bespreek .

source: they can then draw some designs and report back to the class as a group .
af: hulle kan dan 'n paar ontwerpe teken en aan die klas as 'n groep terugrapporteer .

source: you are time travellers and you are preparing for your first jump through the wormhole !
af: julle is tydreisigers en gaan vir die eerste keer deur tyd reis .

source: you may not take anything non organic with you so no metal tins or plastic containers and certainly no computers cell phones or laptops !
af: julle mag niks anorganies saamneem nie met ander woorde geen blikke of plastiekhouers nie en definitief nie rekenaars selfone of skootrekenaars nie !

source: biltong was invented by the voortrekkers who travelled by ox wagon during the great trek .
af: die voortrekkers wat per ossewa gereis hetgedurende die groot trek het biltong ontdek .

source: they needed to preserve meat for the long journey .
af: hulle moes vleis vir die lang rit preserveer .

source: the raw meat was preserved using salt vinegar and spices .
af: die rou vleis is gepreserveer deur sout asyn en speserye te gebruik .

source: imagine being transported 250 years back into history and arriving with only the clothes you are wearing and whatever you have learnt in your head in exactly the same place you are right now .
af: verbeel julle julle word 300 jaar in die verlede teruggeneem .

source: it is late summer and you need to spend a year wherever you are and survive until the wormhole opens again at that exact spot and allows you to return to 'the future' .
af: julle arriveer in presies dieselfde plek waar julle nou is met net die klere aan julle lywe en die kennis in julle koppe .

source: your mission gather as much information on the local inhabitants and the food they eat their ways of living and how they survive the elements and natural dangers in their environment .
af: julle missie versamel soveel inligting as moontlik oor die plaaslike bevolking en die koswat hulle eet hul leefwyses en hoe hulle die elemente oorleef sowel as natuurlike gevare inhul omgewing .

source: when you return you will need to explain how they preserved and processed different foods to last them through winter and how they packaged and protected this food from scavenging animals and pesky insects .
af: wanneer julle terugkeer moet julle in staat wees om alles te verduidelik .

source: brainstorm this problem with your group .
af: hou 'n dinkskrum oor hierdie probleem in julle groepie .

source: list as many different questions or problems that you can think of that will affect you
af: maak 'n lys van soveel moontlik verskillende vrae en probleme waaraan jullekan dink wat julle sal raak

source: think especially of food and shelter and specifically how you will collect preserve and process any food that you collect .
af: dink veral aan kos en skuiling en spesifiek aan hoe julle die kos bymekaar gaan maak preserveer en verwerk .

source: remember you are not allowed to take anything that is not organic so no pocket knives nylon rope or even lighters can go with you !
af: onthou julle magniks saamneem wat anorganies is nie dus geen knipmesse nylontou of selfs vuuraanstekers nie !

source: design the following items that you can make and use when you land .
af: ontwerp en maak die volgende items wat julle kan gebruik wanneer julle daar aankom .

source: give each person in your group one of these items to make and bring to class .
af: elke persoon in die groep maak een van hierdie items en bring dit skool toe .
